#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_acm_certificate.pub_acm_cert: Refreshing state... [id=arn:aws:acm:us-east-1:161444948461:certificate/ca905f14-6e5f-4969-92d9-9bcc56789321]
aws_iam_role.pub_last_lambda_inv_exec: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002]
aws_cloudwatch_event_rule.every_one_hour: Refreshing state... [id=every-one-hour]
aws_iam_role.iam_for_lambda: Refreshing state... [id=pub_lastlocal_lambda_invalidation_role]
aws_s3_bucket_object.pub_repo_html["download.png"]: Refreshing state... [id=download.png]
aws_kms_key.credentialbucketkey: Refreshing state... [id=6f7bae89-6f6b-42e9-8189-4654b315126f]
aws_s3_bucket_object.pub_repo_html["history.html"]: Refreshing state... [id=history.html]
aws_iam_role.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001]
aws_s3_bucket_object.pub_repo_html["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_object.pub_repo_html["about.html"]: Refreshing state... [id=about.html]
aws_iam_role.pub_lambda_covid: Refreshing state... [id=pub-lambda-covid-policy-20210328102712141600000001]
aws_s3_bucket_public_access_block.pub_s3_bucket_pub_policy: Refreshing state... [id=lastlocalcase.sg]
aws_cloudfront_origin_access_identity.pub_origin_access_identity: Refreshing state... [id=EFVXTJMSPUTAJ]
aws_s3_bucket.terraform_artifact_bucket: Refreshing state... [id=sg-lastlocalcase-artifact-bucket]
aws_lambda_function.pub_folder_index_redirect: Refreshing state... [id=pub-last-index-redirect]
aws_iam_role_policy.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001:pub-last-lambda-policy-20210327112911683900000004]
aws_iam_role_policy.pub_lambda_invalidation_execution: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002:public-invalidation-policy-20210327112911590900000003]
aws_lambda_function.pub_s3_invalidation: Refreshing state... [id=public_lastlocal_invalidation]
aws_s3_bucket.pub_s3_bucket: Refreshing state... [id=lastlocalcase.sg]
aws_lambda_function.pub_covid_scraper: Refreshing state... [id=covid_scraper]
aws_iam_role_policy.pub_lambda_covid: Refreshing state... [id=pub-lambda-covid-policy-20210328102712141600000001:pub-lambda-covid-policy-20210328102712456400000002]
aws_lambda_permission.allow_cloudwatch_to_call_check_covid: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.check_covid_every_one_hour: Refreshing state... [id=every-one-hour-lambda]
aws_route53_record.pub_cert_validation: Refreshing state... [id=Z00563891EDJS4V1EERXS__3a7894d230589c3c6b3e2ca56b6488ce.lastlocalcase.sg._CNAME]
aws_lambda_permission.allow_covid_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_permission.allow_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_cloudfront_distribution.pub_s3_distribution: Refreshing state... [id=E3INA79U1U2Q7W]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=lastlocalcase.sg]
aws_route53_record.pub_route53_record: Refreshing state... [id=Z00563891EDJS4V1EERXS_lastlocalcase.sg_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket_object.pub_repo_html["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "pub_repo_html" {
      ~ etag          = "c334a75ebaedfdb215a68b6beea9147a" -> "8c0b035bd81b5a9475db2e56a295d518"
        id            = "about.html"
        tags          = {}
      ~ version_id    = "Wz76ZAY_Q.37AoZptzYK.Rnfkd0YqM7x" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.pub_repo_html["favicon.png"] will be created
  + resource "aws_s3_bucket_object" "pub_repo_html" {
      + acl                    = "private"
      + bucket                 = "lastlocalcase.sg"
      + content_type           = "text/html; charset=UTF-8"
      + etag                   = "30b544c678a634b49308550e0edb93b1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../files/html/favicon.png"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.pub_repo_html["history.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "pub_repo_html" {
      ~ etag          = "f333a969593207dab9be93c61c64a7b6" -> "e4aea97d631f41f0c0e3e057b739f7bb"
        id            = "history.html"
        tags          = {}
      ~ version_id    = "v31iQ83U5kZd1.pewP6jDQDpdFu1c.O7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.pub_repo_html["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "pub_repo_html" {
      ~ etag          = "76ad48d5098dba3283a7c0ee5360c1a8" -> "000900c589c9329a660beedc52e51098"
        id            = "index.html"
        tags          = {}
      ~ version_id    = "RfvXQvXnsR0pSPQDEZKxgOVBHsZJ4Kdj" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfapply

To perform exactly these actions, run the following command to apply:
    terraform apply "tfapply"

```
</details>
*Pusher: @artagel, Action: `pull_request`*